tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX63N/r_usb_basic/src/driver/r_usb_pdriver.c
/******************************************************************************
 Function Name   : usb_pstd_set_eptbl_index
 Description     : Set endpoint index in table (buffer) region based on config-
                 : uration descriptor. In other words, set which endpoints to
                 : use based on specified configuration,
 Arguments       : uint16_t con_num : Configuration Number.
                 : uint16_t int_num : Interface Number.
                 : uint16_t alt_num : Alternate Setting.
 Return value    : none
 ******************************************************************************/
void usb_pstd_set_eptbl_index (uint16_t con_num, uint16_t int_num, uint16_t alt_num)
{
    uint8_t * ptr;
    uint16_t i;
    uint16_t j;
    uint16_t length;
    uint16_t start;
    uint16_t numbers;
    uint16_t ep;
    uint16_t dir;

    /* Configuration descriptor */
    ptr = g_usb_pstd_driver.p_configtbl;
    i = *ptr;
    length = (uint16_t) (*(uint8_t *) ((uint32_t) ptr + (uint32_t) 3u));
    length = (uint16_t) (length << 8);
    length += (uint16_t) (*(uint8_t *) ((uint32_t) ptr + (uint32_t) 2u));
    ptr = (uint8_t *) ((uint32_t) ptr + (*ptr));
    start = 0;
    numbers = 0;
    j = 0;

    for (; i < length;)
    {
        /* Descriptor type ? */
        switch (*(uint8_t *) ((uint32_t) ptr + (uint32_t) 1u))
        {
            /* Interface */
            case USB_DT_INTERFACE :
                if (((*(uint8_t *) ((uint32_t) ptr + (uint32_t) 2u)) == int_num)
                        && ((*(uint8_t *) ((uint32_t) ptr + (uint32_t) 3u)) == alt_num))
                {
                    numbers = *(uint8_t *) ((uint32_t) ptr + (uint32_t) 4u);
                }
                else
                {
                    start += (*(uint8_t *) ((uint32_t) ptr + (uint32_t) 4u));
                }
                i += (*ptr);
                ptr = (uint8_t *) ((uint32_t) ptr + (*ptr));
            break;

                /* Endpoint */
            case USB_DT_ENDPOINT :
                if (j < numbers)
                {
                    ep = (uint16_t) *(uint8_t *) ((uint32_t) ptr + (uint32_t) 2u);
                    if (USB_EP_IN == (ep & USB_EP_DIRMASK))
                    {
                        dir = 1; /* IN */
                    }
                    else
                    {
                        dir = 0; /* OUT */
                    }
                    ep &= (uint16_t) 0x0f;
                    g_usb_pstd_eptbl_index[dir][ep] = (uint8_t) (start + j);
                    ++j;
                }
                i += (*ptr);
                ptr = (uint8_t *) ((uint32_t) ptr + (*ptr));
            break;

                /* Device */
            case USB_DT_DEVICE :

                /* Continue */
                /* Configuration */
            case USB_DT_CONFIGURATION :

                /* Continue */
                /* String */
            case USB_DT_STRING :

                /* Continue */
                /* Class, Vendor, else */
            default :
                i += (*ptr);
                ptr = (uint8_t *) ((uint32_t) ptr + (*ptr));
            break;
        }
    }
}
/******************************************************************************
 End of function usb_pstd_set_eptbl_index
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_pstd_chk_remote
 Description     : Check if the RemoteWakeUp bit for the configuration descriptor is set.
 Arguments       : none
 Return value    : uint16_t : remote wakeup status (TRUE/FALSE).
 ******************************************************************************/
uint16_t usb_pstd_chk_remote (void)
{
    uint8_t atr;

    if (0 == g_usb_pstd_config_num)
    {
        return USB_FALSE;
    }

    /* Get Configuration Descriptor - bmAttributes */
    atr = *(uint8_t *) ((uint32_t) g_usb_pstd_driver.p_configtbl + (uint32_t) 7u);

    /* Remote WakeUp check(= D5) */
    if ((atr & USB_CF_RWUPON) == USB_CF_RWUPON)
    {
        return USB_TRUE;
    }
    return USB_FALSE;
}
/******************************************************************************
 End of function usb_pstd_chk_remote
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_pstd_get_current_power
 Description     : Find out how the peripheral is powered by looking at the con-
                 : figuration descriptor.
 Arguments       : none
 Return value    : uint8_t : Current power means; self-powered or bus-powered
                 : (GS_SELFPOWERD/GS_BUSPOWERD).
 ******************************************************************************/
uint8_t usb_pstd_get_current_power (void)
{
    /*
     * Please answer the currently power of your system.
     */

    uint8_t tmp;
    uint8_t currentpower;

    /* Standard configuration descriptor */
    tmp = *(uint8_t *) ((uint32_t) g_usb_pstd_driver.p_configtbl + (uint32_t) 7u);
    if ((tmp & USB_CF_SELFP) == USB_CF_SELFP)
    {
        /* Self Powered */
        currentpower = USB_GS_SELFPOWERD;
    }
    else
    {
        /* Bus Powered */
        currentpower = USB_GS_BUSPOWERD;
    }

    /* Check currently powered */

    return currentpower;
}
/******************************************************************************
 End of function usb_pstd_get_current_power
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_pstd_set_pipe_register
 Description     : Configure specified pipe.
 Arguments       : uint16_t pipe_number  : Pipe number.
                 : uint16_t *tbl         : DEF_EP table pointer.
 Return value    : none
 ******************************************************************************/
void usb_pstd_set_pipe_register (uint16_t pipe_number, uint16_t * tbl)
{
    uint16_t i;
    uint16_t pipe;
    uint16_t ep;
    uint16_t dir;

    switch (pipe_number)
    {
        /* All pipe initialized */
        case USB_USEPIPE :

            /* Current FIFO port Clear */
            usb_cstd_chg_curpipe(USB_NULL, (uint16_t) USB_PIPE0, (uint16_t) USB_CUSE, USB_FALSE);
            for (i = 0; USB_PDTBLEND != tbl[i]; i += USB_EPL)
            {
                /* Pipe number */
                pipe = (uint16_t) (tbl[i + 0] & USB_CURPIPE);
                usb_cstd_pipe_init(USB_NULL, pipe, tbl, i);
            }
        break;

            /* Peripheral pipe initialized */
        case USB_PERIPIPE :

            /* Current FIFO port Clear */
            usb_cstd_chg_curpipe(USB_NULL, (uint16_t) USB_PIPE0, (uint16_t) USB_CUSE, USB_FALSE);
            for (ep = USB_EP1; ep <= USB_MAX_EP_NO; ++ep)
            {
                for (dir = 0; dir < 2; dir++)
                {
                    if (USB_ERROR != g_usb_pstd_eptbl_index[dir][ep])
                    {
                        i = (uint16_t) (USB_EPL * g_usb_pstd_eptbl_index[dir][ep]);

                        /* Pipe number */
                        pipe = (uint16_t) (tbl[i + 0] & USB_CURPIPE);
                        usb_cstd_pipe_init(USB_NULL, pipe, tbl, i);
                    }
                }
            }
        break;

            /* Clear Peripheral pipe register */
        case USB_CLRPIPE :

            /* Current FIFO port Clear */
            usb_cstd_chg_curpipe(USB_NULL, (uint16_t) USB_PIPE0, (uint16_t) USB_CUSE, USB_FALSE);
            for (ep = USB_EP1; ep <= USB_MAX_EP_NO; ++ep)
            {
                for (dir = 0; dir < 2; dir++)
                {
                    if (USB_ERROR != g_usb_pstd_eptbl_index[dir][ep])
                    {
                        i = (uint16_t) (USB_EPL * g_usb_pstd_eptbl_index[dir][ep]);

                        /* Pipe number */
                        pipe = (uint16_t) (tbl[i + 0] & USB_CURPIPE);
                        usb_cstd_clr_pipe_cnfg(USB_NULL, pipe);
                    }
                }
            }
        break;

            /* Pipe initialized */
        default :

