tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX63N/r_usb_basic/src/driver/r_usb_pdriver.c
            /* Current FIFO port clear */
            usb_cstd_chg_curpipe(USB_NULL, (uint16_t) USB_PIPE0, (uint16_t) USB_CUSE, USB_FALSE);
            for (i = 0; USB_PDTBLEND != tbl[i] ; i += USB_EPL)
            {
                /* Pipe number */
                pipe = (uint16_t) (tbl[i + 0] & USB_CURPIPE);
                if (pipe == pipe_number)
                {
                    usb_cstd_pipe_init(USB_NULL, pipe, tbl, i);
                }
            }
        break;
    }
}
/******************************************************************************
 End of function usb_pstd_set_pipe_register
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_pstd_chk_pipe_info
 Description     : Analyze descriptor information of the connected USB Device, 
                 : and reflect it in the pipe information table.
 Argument        : uint16_t speed            : device speed
                 : uint16_t *ep_tbl          : DEF_EP table pointer
                 : uint8_t  *descriptor      : Endpoint Descriptor table
 Return          : uint16_t                  : DIR_P_IN / DIR_P_OUT / USB_ERROR
 ******************************************************************************/
uint16_t usb_pstd_chk_pipe_info (uint16_t speed, uint16_t *ep_tbl, uint8_t *descriptor)
{
    uint16_t pipe_cfg;
    uint16_t pipe_maxp;
    uint16_t pipe_peri;
    uint16_t retval;
    uint16_t work1;
    uint16_t work2;
    uint16_t useport = USB_CUSE;

    /* Check Endpoint descriptor */
    /* Descriptor Type */
    if (USB_DT_ENDPOINT == descriptor[1])
    {
        switch ((uint16_t) (descriptor[3] & USB_EP_TRNSMASK))
        {
            /* Control Endpoint */
            case USB_EP_CNTRL :
                USB_PRINTF0("###Control pipe is not support.\n");
                return USB_ERROR;
            break;

                /* Isochronous Endpoint */
            case USB_EP_ISO :
                if ((USB_PIPE1 != ep_tbl[0]) && (USB_PIPE2 != ep_tbl[0]))
                {
                    USB_PRINTF0("###Iso pipe is 1 or 2.\n");
                    return USB_ERROR;
                }
                USB_PRINTF0(" ISOCH ");
                pipe_cfg = USB_TYPFIELD_ISO;
            break;

                /* Bulk Endpoint */
            case USB_EP_BULK :
                if ((ep_tbl[0] < USB_PIPE1) || (ep_tbl[0] > USB_PIPE5))
                {
                    USB_PRINTF0("###Bulk pipe is 1 to 5.\n");
                    return USB_ERROR;
                }

                /* USB_PRINTF0(" BULK "); */
                pipe_cfg = USB_TYPFIELD_BULK;
            break;

                /* Interrupt Endpoint */
            case USB_EP_INT :
                if ((ep_tbl[0] < USB_PIPE6) || (ep_tbl[0] > USB_MAX_PIPE_NO))
                {
                    USB_PRINTF0("###Int pipe is 6 to 9.\n");
                    return USB_ERROR;
                }

                /* USB_PRINTF0(" INT "); */
                pipe_cfg = USB_TYPFIELD_INT;
            break;
            default :
                USB_PRINTF0("###Endpoint Descriptor error.\n");
                return USB_ERROR;
            break;
        }

        /* Set pipe configuration table */
        if ((descriptor[2] & USB_EP_DIRMASK) == USB_EP_OUT)
        {
            /* OUT(receive) */

            if ((descriptor[3] & USB_EP_TRNSMASK) != USB_EP_ISO)
            {
                /* Compulsory SHTNAK */
                pipe_cfg |= (USB_CFG_SHTNAK | USB_DIR_P_OUT);
            }
            else
            {
                pipe_cfg |= USB_DIR_P_OUT;
            }

            useport = usb_pstd_pipe2fport(ep_tbl[0]);
            switch(useport)
            {
                case USB_CUSE :

                    /* continue */
                case USB_D0USE :

                    /* continue */
                case USB_D1USE :
                    pipe_cfg |= (uint16_t) (ep_tbl[1] & (USB_DBLBFIELD | USB_CNTMDFIELD));
                break;
#if ((USB_CFG_DTC == USB_CFG_ENABLE) || (USB_CFG_DMA == USB_CFG_ENABLE))
                    case USB_D0DMA:
                    /* continue */
                    case USB_D1DMA:
                    pipe_cfg |= (uint16_t)((uint16_t)(ep_tbl[1] & (USB_DBLBFIELD|USB_CNTMDFIELD)) );
                    break;
#endif    /* ((USB_CFG_DTC == USB_CFG_ENABLE) || (USB_CFG_DMA == USB_CFG_ENABLE)) */
                default :
                    USB_PRINTF0("###EndPoint Descriptor error.\n");
                    return USB_ERROR;
                break;
            }
            retval = USB_DIR_P_OUT;
        }
        else
        {
            /* IN(send) */
            pipe_cfg |= (uint16_t) ((uint16_t) (ep_tbl[1] & (USB_DBLBFIELD | USB_CNTMDFIELD)) | USB_DIR_P_IN);
            retval = USB_DIR_P_IN;
        }

        /* EndPoint number set */
        pipe_cfg |= (uint16_t) (descriptor[2] & USB_EP_NUMMASK);

        /* Max packet size set */
        pipe_maxp = (uint16_t) (descriptor[4] | (uint16_t) ((uint16_t) descriptor[5] << 8u));

        /* Buffer flash */
        pipe_peri = (uint16_t) (ep_tbl[4] & (~USB_IITVFIELD));
        if (0 != descriptor[6])
        {
            /* FS/LS interrupt */
            if (((uint16_t) (pipe_cfg & USB_TYPFIELD) == USB_INT) && (USB_HSCONNECT != speed))
            {
                work1 = descriptor[6];
                work2 = 0;
                for (; 0 != work1; work2++)
                {
                    work1 = (uint16_t) (work1 >> 1);
                }
                if (0 != work2)
                {
                    /* Interval time */
                    pipe_peri |= (uint16_t) (work2 - 1);
                }
            }
            else
            {
                if (descriptor[6] <= 8)
                {
                    /* Interval time */
                    pipe_peri |= (uint16_t) ((descriptor[6] - 1u) & (USB_IITVFIELD));
                }
                else
                {
                    /* Interval time */
                    pipe_peri |= (uint16_t) ((0x00FFu) & (USB_IITVFIELD));
                }
            }
        }
        ep_tbl[1] = pipe_cfg;
        ep_tbl[3] = pipe_maxp;
        ep_tbl[4] = pipe_peri;

        /* USB_PRINTF4(" pipe%d configuration %04X %04X %04X\n", ep_tbl[0], ep_tbl[1], ep_tbl[3], ep_tbl[4]); */
    }
    else
    {
        USB_PRINTF0("###Endpoint Descriptor error.\n");
        return USB_ERROR;
    }
    return (retval);
}/* End of function usb_pstd_chk_pipe_info */

