tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX63N/r_usb_basic/src/driver/r_usb_pdriver.c
/******************************************************************************
 Function Name   : usb_peri_suspended
 Description     : Peripheral Devices Class suspended function
 Arguments       : usb_utr_t    *ptr        : Not used
                 : uint16_t     data1       : Not used
                 : uint16_t     data2       : Not used
 Return value    : none
 ******************************************************************************/
void usb_peri_suspended(usb_utr_t *ptr, uint16_t data1, uint16_t data2)
{
    usb_ctrl_t ctrl;

    ctrl.module = USB_CFG_USE_USBIP;
    usb_set_event(USB_STS_SUSPEND, &ctrl);
} /* End of function usb_suspended() */

/******************************************************************************
 Function Name   : usb_peri_resume
 Description     : Peripheral Devices Class resume function
 Arguments       : usb_utr_t    *ptr        : Not used
                 : uint16_t     data1       : Not used
                 : uint16_t     data2       : Not used
 Return value    : none
 ******************************************************************************/
void usb_peri_resume(usb_utr_t *ptr, uint16_t data1, uint16_t data2)
{
    usb_ctrl_t ctrl;

    ctrl.module = USB_CFG_USE_USBIP;
    usb_set_event(USB_STS_RESUME, &ctrl);
} /* End of function usb_peri_resume() */

/******************************************************************************
 Function Name   : usb_peri_interface
 Description     : Peripheral Devices Class set interface function
 Arguments       : usb_utr_t    *ptr        : Not used
                 : uint16_t     data1       : Not used
                 : uint16_t     data2       : Not used
 Return value    : none
 ******************************************************************************/
void usb_peri_interface(usb_utr_t *ptr, uint16_t data1, uint16_t data2)
{
#if defined(USB_CFG_PMSC_USE)
    usb_pmsc_receive_cbw();
#else   /* defined(USB_CFG_PMSC_USE) */
    /* Non processing */
#endif  /* defined(USB_CFG_PMSC_USE) */
} /* End of function usb_peri_interface() */

#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */

/******************************************************************************
 End  Of File
 ******************************************************************************/
